{"config": [{"config": {"batch_input_shape": [null, 160, 320, 3], "trainable": true, "cropping": [[75, 25], [0, 0]], "input_dtype": "float32", "name": "cropping2d_1"}, "class_name": "Cropping2D"}, {"config": {"dim_ordering": "tf", "name": "averagepooling2d_1", "pool_size": [1, 4], "trainable": false, "border_mode": "valid", "strides": [1, 4]}, "class_name": "AveragePooling2D"}, {"config": {"output_shape_type": "raw", "function_type": "lambda", "output_shape": null, "arguments": {}, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>-\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "trainable": true, "name": "lambda_1"}, "class_name": "Lambda"}, {"config": {"b_constraint": null, "dim_ordering": "tf", "nb_row": 3, "name": "convolution2d_1", "activity_regularizer": null, "bias": true, "activation": "relu", "border_mode": "valid", "subsample": [2, 2], "nb_filter": 24, "W_regularizer": null, "trainable": true, "W_constraint": null, "nb_col": 3, "init": "glorot_uniform", "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "name": "maxpooling2d_1", "pool_size": [2, 2], "trainable": true, "border_mode": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"b_constraint": null, "dim_ordering": "tf", "nb_row": 3, "name": "convolution2d_2", "activity_regularizer": null, "bias": true, "activation": "relu", "border_mode": "valid", "subsample": [1, 1], "nb_filter": 36, "W_regularizer": null, "trainable": true, "W_constraint": null, "nb_col": 3, "init": "glorot_uniform", "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "name": "maxpooling2d_2", "pool_size": [2, 2], "trainable": true, "border_mode": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"b_constraint": null, "dim_ordering": "tf", "nb_row": 3, "name": "convolution2d_3", "activity_regularizer": null, "bias": true, "activation": "relu", "border_mode": "valid", "subsample": [1, 1], "nb_filter": 48, "W_regularizer": null, "trainable": true, "W_constraint": null, "nb_col": 3, "init": "glorot_uniform", "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "name": "maxpooling2d_3", "pool_size": [2, 2], "trainable": true, "border_mode": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.1, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"b_constraint": null, "name": "dense_1", "activity_regularizer": null, "bias": true, "activation": "relu", "W_regularizer": null, "trainable": true, "W_constraint": null, "output_dim": 100, "init": "glorot_uniform", "b_regularizer": null, "input_dim": 288}, "class_name": "Dense"}, {"config": {"b_constraint": null, "name": "dense_2", "activity_regularizer": null, "bias": true, "activation": "relu", "W_regularizer": null, "trainable": true, "W_constraint": null, "output_dim": 50, "init": "glorot_uniform", "b_regularizer": null, "input_dim": 100}, "class_name": "Dense"}, {"config": {"b_constraint": null, "name": "dense_3", "activity_regularizer": null, "bias": true, "activation": "relu", "W_regularizer": null, "trainable": true, "W_constraint": null, "output_dim": 10, "init": "glorot_uniform", "b_regularizer": null, "input_dim": 50}, "class_name": "Dense"}, {"config": {"b_constraint": null, "name": "dense_4", "activity_regularizer": null, "bias": true, "activation": "linear", "W_regularizer": null, "trainable": false, "W_constraint": null, "output_dim": 1, "init": "glorot_uniform", "b_regularizer": null, "input_dim": 10}, "class_name": "Dense"}], "keras_version": "1.2.1", "class_name": "Sequential"}